cmsis-svd/cmsis-svd/data/Spansion/MB9AF15xN_svd.xml
        <!-- REGISTER "RCADR2" -->
        <register>
          <name>RCADR2</name>
          <description>Device Address Setting Register 2</description>
          <addressOffset>0x4C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x1F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RCADR2" -->
            <field>
              <name>RCADR2</name>
              <description>Device Address 2</description>
              <lsb>0</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "RCADR1" -->
        <register>
          <name>RCADR1</name>
          <description>Device Address Setting Register 1</description>
          <addressOffset>0x4D</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x1F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RCADR1" -->
            <field>
              <name>RCADR1</name>
              <description>Device Address 1</description>
              <lsb>0</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "RCDTHL" -->
        <register>
          <name>RCDTHL</name>
          <description>Data Save Register (High-Low)</description>
          <addressOffset>0x50</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RCDTHL" -->
            <field>
              <name>RCDTHL</name>
              <description>RCDTHL</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "RCDTHH" -->
        <register>
          <name>RCDTHH</name>
          <description>Data Save Register (High-High)</description>
          <addressOffset>0x51</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RCDTHH" -->
            <field>
              <name>RCDTHH</name>
              <description>RCDTHH</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "RCDTLL" -->
        <register>
          <name>RCDTLL</name>
          <description>Data Save Register (Low-Low)</description>
          <addressOffset>0x54</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RCDTLL" -->
            <field>
              <name>RCDTLL</name>
              <description>RCDTLL</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "RCDTLH" -->
        <register>
          <name>RCDTLH</name>
          <description>Data Save Register (Low-High)</description>
          <addressOffset>0x55</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RCDTLH" -->
            <field>
              <name>RCDTLH</name>
              <description>RCDTLH</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "RCCKD" -->
        <register>
          <name>RCCKD</name>
          <description>Clock Division Setting Register</description>
          <addressOffset>0x58</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x1FFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CKSEL" -->
            <field>
              <name>CKSEL</name>
              <description>Operating clock selection bit</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CKDIV" -->
            <field>
              <name>CKDIV</name>
              <description>Operating clock division setting bits</description>
              <lsb>0</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "RCRHW" -->
        <register>
          <name>RCRHW</name>
          <description>Repeat Code "H" Width Setting Register</description>
          <addressOffset>0x5C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RCRHW" -->
            <field>
              <name>RCRHW</name>
              <description>"Repeat code "H" width setting bits"</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "RCRC" -->
        <register>
          <name>RCRC</name>
          <description>Repeat Code Interrupt Control Register</description>
          <addressOffset>0x5D</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x11</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RCIE" -->
            <field>
              <name>RCIE</name>
              <description>Repeat Code Interrupt enable bit </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RC" -->
            <field>
              <name>RC</name>
              <description>Repeat code detection flag bit</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "RCLE" -->
        <register>
          <name>RCLE</name>
          <description>Data Bit Width Violation Control Register</description>
          <addressOffset>0x61</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFB</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LELIE" -->
            <field>
              <name>LELIE</name>
              <description>Maximum data bit width violation interrupt enable bit</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LESIE" -->
            <field>
              <name>LESIE</name>
              <description>Minimum data bit width violation interrupt enable bit</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LELE" -->
            <field>
              <name>LELE</name>
              <description>Maximum data bit width violation detection enable bit </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LESE" -->
            <field>
              <name>LESE</name>
              <description>Minimum data bit width violation detection enable bit </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EPE" -->
            <field>
              <name>EPE</name>
              <description>Error pulse output enable bit</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LEL" -->
            <field>
              <name>LEL</name>
              <description>Maximum data bit width violation detection flag bit</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LES" -->
            <field>
              <name>LES</name>
              <description>Minimum data bit width violation detection flag bit</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
